## <span style="text-transform:uppercase">staging</span> Module: etl_lambdas
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 6 to add, 2 to change, 0 to destroy
```

<details>
  <summary>Show Plan</summary>

  ```terraform
  aws_cloudwatch_event_rule.twice-a-day: Refreshing state... [id=twice-a-day]
module.masked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/masked_metrics]
module.unmasked_metrics.aws_cloudwatch_log_group.metric_log: Refreshing state... [id=/aws/lambda/unmasked_metrics]
aws_iam_role.metrics_csv: Refreshing state... [id=metrics_csv_lambda_role]
module.unmasked_metrics.aws_lambda_function.lambda: Refreshing state... [id=unmasked_metrics]
module.masked_metrics.aws_lambda_function.lambda: Refreshing state... [id=masked_metrics]
aws_iam_policy.etl_policies: Refreshing state... [id=arn:aws:iam::005133826942:policy/EtlLambdaAccess]
aws_iam_role_policy_attachment.etl_policies: Refreshing state... [id=metrics_csv_lambda_role-20210519200736877700000001]
aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.tigger-masked_metrics: Refreshing state... [id=twice-a-day-masked_metrics]
aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.tigger-unmasked_metrics: Refreshing state... [id=twice-a-day-unmasked_metrics]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.masked_metrics.aws_efs_access_point.access_point_for_lambda will be created
  + resource "aws_efs_access_point" "access_point_for_lambda" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags_all        = (known after apply)

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/lambda"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "777"
            }
        }
    }

  # module.masked_metrics.aws_efs_file_system.efs_for_lambda will be created
  + resource "aws_efs_file_system" "efs_for_lambda" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "masked_metrics_efs"
        }
      + tags_all                = {
          + "Name" = "masked_metrics_efs"
        }
      + throughput_mode         = "bursting"
    }

  # module.masked_metrics.aws_efs_mount_target.mt will be created
  + resource "aws_efs_mount_target" "mt" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-090d16d17a0b6c2b1",
        ]
      + subnet_id              = "subnet-07f256fc1e9b65732"
    }

  # module.masked_metrics.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "masked_metrics"
        tags                           = {}
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TMP_PATH"    = "/mnt/efs"
                # (3 unchanged elements hidden)
            }
        }

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }


        # (2 unchanged blocks hidden)
    }

  # module.unmasked_metrics.aws_efs_access_point.access_point_for_lambda will be created
  + resource "aws_efs_access_point" "access_point_for_lambda" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags_all        = (known after apply)

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/lambda"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "777"
            }
        }
    }

  # module.unmasked_metrics.aws_efs_file_system.efs_for_lambda will be created
  + resource "aws_efs_file_system" "efs_for_lambda" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "unmasked_metrics_efs"
        }
      + tags_all                = {
          + "Name" = "unmasked_metrics_efs"
        }
      + throughput_mode         = "bursting"
    }

  # module.unmasked_metrics.aws_efs_mount_target.mt will be created
  + resource "aws_efs_mount_target" "mt" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-090d16d17a0b6c2b1",
        ]
      + subnet_id              = "subnet-07f256fc1e9b65732"
    }

  # module.unmasked_metrics.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "unmasked_metrics"
        tags                           = {}
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TMP_PATH"    = "/mnt/efs"
                # (3 unchanged elements hidden)
            }
        }

      + file_system_config {
          + arn              = (known after apply)
          + local_mount_path = "/mnt/efs"
        }


        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
  ```
</details>